In [145]:
import pandas as pd
import numpy as np
import math

In [3]:
ds = 'github/icd/datasets/movies.csv'

In [4]:
df = pd.read_csv(ds)
df.head(10)

,Title,US Gross,Worldwide Gross,US DVD Sales,Production Budget,Release Date,MPAA Rating,Running Time (min),Distributor,Source,Major Genre,Creative Type,Director,Rotten Tomatoes Rating,IMDB Rating,IMDB Votes
0,The Land Girls,146083.0,146083.0,NaN,8000000.0,12-Jun-98,R,NaN,Gramercy,NaN,NaN,NaN,NaN,NaN,6.1,1071.0
1,"First Love, Last Rites",10876.0,10876.0,NaN,300000.0,7-Aug-98,R,NaN,Strand,NaN,Drama,NaN,NaN,NaN,6.9,207.0
2,I Married a Strange Person,203134.0,203134.0,NaN,250000.0,28-Aug-98,NaN,NaN,Lionsgate,NaN,Comedy,NaN,NaN,NaN,6.8,865.0
3,Let's Talk About Sex,373615.0,373615.0,NaN,300000.0,11-Sep-98,NaN,NaN,Fine Line,NaN,Comedy,NaN,NaN,13.0,NaN,NaN
4,Slam,1009819.0,1087521.0,NaN,1000000.0,9-Oct-98,R,NaN,Trimark,Original Screenplay,Drama,Contemporary Fiction,NaN,62.0,3.4,165.0
5,Mississippi Mermaid,24551.0,2624551.0,NaN,1600000.0,15-Jan-99,NaN,NaN,MGM,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,Following,44705.0,44705.0,NaN,6000.0,4-Apr-99,R,NaN,Zeitgeist,NaN,NaN,NaN,Christopher Nolan,NaN,7.7,15133.0
7,Foolish,6026908.0,6026908.0,NaN,1600000.0,9-Apr-99,R,NaN,Artisan,Original Screenplay,Comedy,Contemporary Fiction,NaN,NaN,3.8,353.0
8,Pirates,1641825.0,6341825.0,NaN,40000000.0,1-Jul-86,R,NaN,NaN,NaN,NaN,NaN,Roman Polanski,25.0,5.8,3275.0
9,Duel in the Sun,20400000.0,20400000.0,NaN,6000000.0,31-Dec-46,NaN,NaN,NaN,NaN,NaN,NaN,NaN,86.0,7.0,2906.0

In [5]:
# colunas desnecessaarias
df = df.drop(columns=['Distributor', 'US DVD Sales', 'Running Time (min)', 'Source', 'Major Genre', 'Creative Type', 'Director', 'Release Date', 'MPAA Rating'])
df

,Title,US Gross,Worldwide Gross,Production Budget,Rotten Tomatoes Rating,IMDB Rating,IMDB Votes
0,The Land Girls,146083.0,146083.0,8000000.0,NaN,6.1,1071.0
1,"First Love, Last Rites",10876.0,10876.0,300000.0,NaN,6.9,207.0
2,I Married a Strange Person,203134.0,203134.0,250000.0,NaN,6.8,865.0
3,Let's Talk About Sex,373615.0,373615.0,300000.0,13.0,NaN,NaN
4,Slam,1009819.0,1087521.0,1000000.0,62.0,3.4,165.0
...,...,...,...,...,...,...,...
3196,Zack and Miri Make a Porno,31452765.0,36851125.0,24000000.0,65.0,7.0,55687.0
3197,Zodiac,33080084.0,83080084.0,85000000.0,89.0,NaN,NaN
3198,Zoom,11989328.0,12506188.0,35000000.0,3.0,3.4,7424.0
3199,The Legend of Zorro,45575336.0,141475336.0,80000000.0,26.0,5.7,21161.0
3200,The Mask of Zorro,93828745.0,233700000.0,65000000.0,82.0,6.7,4789.0

In [6]:
# substituir a media no Rotten Tomatoes Rating
na_Tomatoes = df['Rotten Tomatoes Rating'].isna()
mean_Tomatoes  = df['Rotten Tomatoes Rating'].mean()
df['Rotten Tomatoes Rating'][na_Tomatoes == True] = mean_Tomatoes

In [7]:
# substituir a media no IMDB Rating
na_IMDB = df['IMDB Rating'].isna()
mean_IMDB  = df['IMDB Rating'].mean()
df['IMDB Rating'][na_IMDB == True] = mean_IMDB

In [8]:
# substituir a media no IMDB votes
na_IMDB_votes = df['IMDB Votes'].isna()
mean_IMDB_votes  = df['IMDB Votes'].mean()
df['IMDB Votes'][na_IMDB_votes == True] = mean_IMDB_votes

In [9]:
df

,Title,US Gross,Worldwide Gross,Production Budget,Rotten Tomatoes Rating,IMDB Rating,IMDB Votes
0,The Land Girls,146083.0,146083.0,8000000.0,54.336924,6.100000,1071.000000
1,"First Love, Last Rites",10876.0,10876.0,300000.0,54.336924,6.900000,207.000000
2,I Married a Strange Person,203134.0,203134.0,250000.0,54.336924,6.800000,865.000000
3,Let's Talk About Sex,373615.0,373615.0,300000.0,13.000000,6.283467,29908.644578
4,Slam,1009819.0,1087521.0,1000000.0,62.000000,3.400000,165.000000
...,...,...,...,...,...,...,...
3196,Zack and Miri Make a Porno,31452765.0,36851125.0,24000000.0,65.000000,7.000000,55687.000000
3197,Zodiac,33080084.0,83080084.0,85000000.0,89.000000,6.283467,29908.644578
3198,Zoom,11989328.0,12506188.0,35000000.0,3.000000,3.400000,7424.000000
3199,The Legend of Zorro,45575336.0,141475336.0,80000000.0,26.000000,5.700000,21161.000000
3200,The Mask of Zorro,93828745.0,233700000.0,65000000.0,82.000000,6.700000,4789.000000

In [111]:
def logit(x, c=0.4):
    try:
        ans = 1/(1+math.exp(-c*x))
    except OverflowError:
        ans = float('inf')
    
    return ans

In [11]:
def prob(a, b):
    return logit(a-b)

In [12]:
def mi(a, b):
    return 1*prob(a,b) + ((-1)*(1-prob(a,b)))

In [13]:
def update_ranking(a, b, result, k):
    return a + k*(result-mi(a,b))

In [161]:
def score():
    att = []
    att2 = []
    result = -1

    # qualidade = nota no imdb
    a = df['IMDB Rating'].values.tolist()
    b = df['IMDB Rating'].values.tolist()

    for i in range(len(a)):
        for j in range(len(a)):
            k = a[i] + b[j] # tamanho da atualização

            if a[i] > b[j]: # vitoria
                result = 1

            att.append(update_ranking(a[i],b[j],result,k)) 
        att2.append(np.array(att).mean())
        att = []
    return att2

In [162]:
z = np.array(score())
z.shape

(3201,)

In [163]:
z

array([19.18953464, 18.84704473, 18.90606138, ..., 18.15369458,
       19.30917683, 18.96193838])

In [164]:
ranking = pd.DataFrame(data=df['Title'].values.tolist())
ranking

                               0
0                 The Land Girls
1         First Love, Last Rites
2     I Married a Strange Person
3           Let's Talk About Sex
4                           Slam
...                          ...
3196  Zack and Miri Make a Porno
3197                      Zodiac
3198                        Zoom
3199         The Legend of Zorro
3200           The Mask of Zorro

[3201 rows x 1 columns]

In [165]:
ranking['ranking'] = z

In [166]:
ranking

                               0    ranking
0                 The Land Girls  19.189535
1         First Love, Last Rites  18.847045
2     I Married a Strange Person  18.906061
3           Let's Talk About Sex  19.156837
4                           Slam  18.153695
...                          ...        ...
3196  Zack and Miri Make a Porno  18.785080
3197                      Zodiac  19.156837
3198                        Zoom  18.153695
3199         The Legend of Zorro  19.309177
3200           The Mask of Zorro  18.961938

[3201 rows x 2 columns]

In [167]:
ranking.sort_values(by=['ranking'], ascending=False)

                                  0    ranking
1830                       G.I.Jane  19.324360
3005                            xXx  19.324360
1540                 Daddy Day Care  19.324360
319          Friday the 13th Part 2  19.324360
1209                 The Art of War  19.324360
...                             ...        ...
1590                 Disaster Movie  15.464822
1515                      Crossover  15.464822
1754           From Justin to Kelly  15.266132
406            The Helix...  Loaded  15.063578
1247  Super Babies: Baby Geniuses 2  14.857267

[3201 rows x 2 columns]